# StairsRunWinderEndWithStraight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunWinderEndWithStraight Property
ParameterTypeId Class See Also
---
"End with Straight Run": Winder end with straight run
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunWinderEndWithStraight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunWinderEndWithStraight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunWinderEndWithStraight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace